package seeders

import (
	D "docker/database"
	M "docker/models"
	"fmt"
	"math/rand"
	"time"
)

var (
	firstNames = []string{"آرمان", "سارا", "محمد", "نیلوفر", "علی", "نازنین", "رضا", "آتنا", "محسن", "پریا", "امیر", "مهران", "نازیلا", "مرتضی", "راحله", "مهدی", "فاطمه", "حسین", "نگین", "حامد", "نرگس", "عباس", "سحر", "علیرضا", "ریما", "مجید", "زهرا", "علی‌اصغر", "یاسمن", "مسعود", "ناهید", "بابک", "الهام", "رضوان", "شهرزاد", "امین", "النا", "مجتبی", "سارینا", "سید", "آتوسا", "حسام", "آرزو", "مهراد", "نریمان", "محمدرضا", "نیکا", "فریدون", "نرگس", "امیرحسین"}
	lastNames  = []string{"احمدی", "رضایی", "محمدی", "نجفی", "حسینی", "قاسمی", "علیزاده", "صادقی", "جعفری", "صفری", "مرادی", "نوروزی", "رضوانی", "کریمی", "شمسی", "محمدزاده", "صادقیان", "زارع", "قربانی", "حیدری", "جلالی", "رحمانی", "بهرامی", "نظری", "یزدانی", "موسوی", "شاه‌پور", "رحیمی", "اکبری", "قنبری", "صمدی", "کمالی", "شریفی", "نصری", "احمدزاده", "رستمی", "جوانمرد", "احمدیان", "اکرمی", "سلطانی", "نوری", "فتحی", "کاوه", "طاهری", "رستگار", "فرهادی", "قنادی", "مدنی", "صالحی"}
)

func generateRandomNames(n int) []string {
	var result []string
	for i := 0; i < n; i++ {
		firstName := firstNames[rand.Intn(len(firstNames))]
		lastName := lastNames[rand.Intn(len(lastNames))]
		fullName := fmt.Sprintf("%s %s", firstName, lastName)
		result = append(result, fullName)
	}
	return result
}

func generateTexts(n int) []string {
	text := `<p dir="RTL" style="text-align:right; margin-bottom:11px"><strong>ماده1 -تعریف</strong><br />كانون فرهنگی و تربیتی دانشآموزان به مركزی اطلاق میشود كه برای اجرای برنامـه هـا و<br />فعالیتهای فرهنگی، ادبی، هنری، ورزشی، اجتماعی، علمی و مهارتی در جهت رشد و شكوفایی<br />استعدادهای نوجوانان و جوانان دانشآموز به ویژه دورههای راهنمـا یی تحصـیلی و متوسـطه در<br />سراسر كشور تشكیل میگردد<br /><strong>ماده 2 -هدف</strong><br />الف- بارور كردن اوقات فراغت دانشآموزان به منظور رشد و شكوفایی استعدادهای معنوی،<br />فكری، جسمی و عاطفی آنان از طریق اجرای برنامهها و فعالیت هـای فرهنگـ ی، ادبـ ی، هنـر ی،<br />ورزشی، اجتماعی، علمی و مهارتی<br />ب- پرورش تقویت روحیه تعاون و اخوت دینـ ی و ایجـاد همبسـتگیی بـ ین دانـش آمـوزان و<br />آموختن روش زندگی اجتماعی به آنان بر اساس موازین اسلامی<br /><strong>فصل دوم- خط مشی، اصول برنامهها و شیوه تأسیس كانون فرهنگی و تربیتی<br />ماده 3</strong> -خط مشی و اصول برنامهریزی كانونهای فرهنگی و تربیتـ ی توسـط معـاون پرورشـ ی<br />پیشنهاد میشود و پس از تأیید وزیر آموزشوپرورش اجرا میگردد<br /><strong>ماده 4 </strong>-تأسیسكانون فرهنگی و تربیتی در هر شهر، شهرستان، منطقه و ناحیه بنا به پیشنهاد<br />مدیركل استان مربوط و موافقـت معـاون پرورشـی وزارت آمـوزش وپـرورش در قالـب<br />برنامهها و اعتبارات مصوب خواهد بود</p>`
	var texts []string
	for i := 0; i < n; i++ {
		texts = append(texts, text+"/n"+text+"/n"+text+"/n"+text)
	}
	return texts
}

var titles = []string{
	"تصویب برنامه‌های فرهنگی و تربیتی دانش‌آموزان",
	"تشکیل کانون‌های فرهنگی و تربیتی در دوره‌های راهنمایی و متوسطه",
	"پیشنهاد خط‌مشی و اصول برنامه‌ریزی کانون‌های فرهنگی و تربیتی",
	"تأسیس کانون‌های فرهنگی و تربیتی در سراسر کشور",
	"موافقت با تأسیس کانون‌های فرهنگی و تربیتی در شهرها و روستاها",
	"اجرای برنامه‌ها و فعالیت‌های فرهنگی و تربیتی برای رشد نوجوانان",
	"پرورش استعدادهای معنوی، فکری و جسمی دانش‌آموزان",
	"ترویج فعالیت‌های اجتماعی و فرهنگی در مدارس",
	"تأسیس کانون‌های فرهنگی و تربیتی بر اساس موازین اسلامی",
	"تشویق به همبستگی و تعاون در بین دانش‌آموزان",
	"توسعه برنامه‌های فرهنگی برای ارتقای سطح فرهنگی جامعه",
	"ترویج مهارت‌های اجتماعی و اخلاقی در دانش‌آموزان",
	"تشویق به مطالعه و تحقیق در زمینه‌های مختلف",
	"تشکیل اردوها و کلاس‌های آموزشی خارج از محیط مدرسه",
	"توسعه برنامه‌های آموزشی ویژه برای دانش‌آموزان با استعداد",
	"تشویق به فعالیت‌های ورزشی و سلامتی در دانش‌آموزان",
	"ترویج هنرها و موسیقی در محیط مدرسه",
	"توسعه برنامه‌های آموزشی و تربیتی با استفاده از فناوری",
	"تشکیل جلسات ارتقاء سطح دانش و فرهنگ در مدارس",
	"ترویج مسئولیت‌پذیری و رهبری در دانش‌آموزان",
	"تشویق به فعالیت‌های داوطلبانه و خیریه در جامعه",
	"تشکیل سمینارها و کارگاه‌های آموزشی برای اولیاء دانش‌آموزان",
	"توسعه برنامه‌های تربیتی برای افزایش انگیزه و انضباط دانش‌آموزان",
	"ترویج ارتقاء فرهنگ سازمانی در مدارس",
	"تشویق به مشارکت در فعالیت‌های محیط‌زیستی و حفظ طبیعت",
	"توسعه برنامه‌های روان‌شناسی برای حفظ سلامت روان دانش‌آموزان",
	"تشکیل کلاس‌های آموزشی برای افزایش مهارت‌های ارتباطی",
	"ترویج فرهنگ احترام و ادب در محیط تحصیلی",
	"تشویق به مشارکت در رقابت‌های علمی و فرهنگی",
	"تشکیل گروه‌های مطالعاتی برای افزایش دانش دانش‌آموزان",
	"توسعه برنامه‌های تربیتی برای پیشگیری از اعتیاد در جامعه",
	"ترویج ارزش‌های اخلاقی و دینی در محیط مدرسه",
	"تشویق به فعالیت‌های هنری و خلاقیت در دانش‌آموزان",
	"تشکیل جلسات ارتقاء سواد فناوری اطلاعات و ارتباطات",
	"توسعه برنامه‌های آموزشی برای ارتقای مهارت‌های زندگی",
	"تشویق به مشارکت در کمپین‌ها و حمایت‌های اجتماعی",
	"تشکیل نمایشگاه‌ها و رویدادهای فرهنگی در مدارس",
	"توسعه برنامه‌های ترویج سلامتی و بهداشت در مدارس",
	"تشویق به فعالیت‌های خیریه و انسانی در جامعه",
	"تشکیل جلسات آموزشی برای اولیاء دانش‌آموزان در حوزه تربیتی",
	"توسعه برنامه‌های آموزشی برای افزایش مهارت‌های اجتماعی",
}

func generateTitles(n int) []string {
	var result []string
	for i := 0; i < n; i++ {
		result = append(result, titles[rand.Intn(len(titles))])
	}
	return result
}

func LawSeeder() {
	names := generateRandomNames(1000)
	texts := generateTexts(1000)
	titles := generateTitles(1000)
	for i := 0; i < 1000; i++ {
		rand.Seed(time.Now().UnixNano()) 
		D.DB().Create(&M.Law{
			Type:               rand.Intn(3) + 1,
			Title:              titles[i],
			SessionNumber:      11,
			SessionDate:        time.Date(1989, 4, 12, 0, 0, 0, 0, time.UTC),
			NotificationNumber: "120/4720",
			NotificationDate:   time.Date(1989, 8, 3, 0, 0, 0, 0, time.UTC),
			Body:               texts[i],
			Image:              "logo-website.png",
			NumberItems:        rand.Intn(20) + 1,
			NumberNotes:        rand.Intn(20) + 1,
			Recommender:        names[i],
		})
	}

}
